dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 4B8, Read Data and Bit Flip Register 44 */
#define MTU_MC4_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614B8u)

/** \brief 4BA, Read Data and Bit Flip Register 45 */
#define MTU_MC4_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614BAu)

/** \brief 4BC, Read Data and Bit Flip Register 46 */
#define MTU_MC4_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614BCu)

/** \brief 4BE, Read Data and Bit Flip Register 47 */
#define MTU_MC4_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614BEu)

/** \brief 4C0, Read Data and Bit Flip Register 48 */
#define MTU_MC4_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C0u)

/** \brief 4C2, Read Data and Bit Flip Register 49 */
#define MTU_MC4_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C2u)

/** \brief 4C4, Read Data and Bit Flip Register 50 */
#define MTU_MC4_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C4u)

/** \brief 4C6, Read Data and Bit Flip Register 51 */
#define MTU_MC4_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C6u)

/** \brief 4C8, Read Data and Bit Flip Register 52 */
#define MTU_MC4_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614C8u)

/** \brief 4CA, Read Data and Bit Flip Register 53 */
#define MTU_MC4_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614CAu)

/** \brief 4CC, Read Data and Bit Flip Register 54 */
#define MTU_MC4_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614CCu)

/** \brief 4CE, Read Data and Bit Flip Register 55 */
#define MTU_MC4_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614CEu)

/** \brief 4D0, Read Data and Bit Flip Register 56 */
#define MTU_MC4_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D0u)

/** \brief 4D2, Read Data and Bit Flip Register 57 */
#define MTU_MC4_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D2u)

/** \brief 4D4, Read Data and Bit Flip Register 58 */
#define MTU_MC4_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D4u)

/** \brief 4D6, Read Data and Bit Flip Register 59 */
#define MTU_MC4_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D6u)

/** \brief 4D8, Read Data and Bit Flip Register 60 */
#define MTU_MC4_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614D8u)

/** \brief 4DA, Read Data and Bit Flip Register 61 */
#define MTU_MC4_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614DAu)

/** \brief 4DC, Read Data and Bit Flip Register 62 */
#define MTU_MC4_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614DCu)

/** \brief 4DE, Read Data and Bit Flip Register 63 */
#define MTU_MC4_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614DEu)

/** \brief 4E0, Read Data and Bit Flip Register 64 */
#define MTU_MC4_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614E0u)

/** \brief 4E2, Read Data and Bit Flip Register 65 */
#define MTU_MC4_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614E2u)

/** \brief 4E4, Read Data and Bit Flip Register 66 */
#define MTU_MC4_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00614E4u)

/** \brief 4EE, Alarm Sources Configuration Register */
#define MTU_MC4_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00614EEu)

/** \brief 4F0, SSH Safety Faults Status Register  */
#define MTU_MC4_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00614F0u)

/** \brief 4F2, Error Information Register 0 */
#define MTU_MC4_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614F2u)

/** \brief 4F4, Error Information Register 1 */
#define MTU_MC4_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614F4u)

/** \brief 4F6, Error Information Register 2 */
#define MTU_MC4_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614F6u)

/** \brief 4F8, Error Information Register 3 */
#define MTU_MC4_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614F8u)

/** \brief 4FA, Error Information Register 4 */
#define MTU_MC4_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00614FAu)

/** \brief 500, Configuration Registers */
#define MTU_MC5_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061500u)

/** \brief 502, Configuration Register 1 */
#define MTU_MC5_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061502u)

/** \brief 504, MBIST Control Register */
#define MTU_MC5_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061504u)

/** \brief 506, Status Register */
#define MTU_MC5_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061506u)

/** \brief 508, Range Register, single address mode */
#define MTU_MC5_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061508u)

/** \brief 50C, Revision ID Register */
#define MTU_MC5_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006150Cu)

/** \brief 50E, ECC Safety Register */
#define MTU_MC5_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006150Eu)

/** \brief 510, Memory ECC Detection Register */
#define MTU_MC5_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061510u)

/** \brief 512, Error Tracking Register 0 */
#define MTU_MC5_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061512u)

/** \brief 514, Error Tracking Register 1 */
#define MTU_MC5_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061514u)

/** \brief 516, Error Tracking Register 2 */
#define MTU_MC5_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061516u)

/** \brief 518, Error Tracking Register 3 */
#define MTU_MC5_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061518u)

/** \brief 51A, Error Tracking Register 4 */
#define MTU_MC5_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006151Au)

/** \brief 560, Read Data and Bit Flip Register 0 */
#define MTU_MC5_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061560u)

/** \brief 562, Read Data and Bit Flip Register 1 */
#define MTU_MC5_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061562u)

