dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 12F6, Error Information Register 2 */
#define MTU_MC18_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622F6u)

/** \brief 12F8, Error Information Register 3 */
#define MTU_MC18_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622F8u)

/** \brief 12FA, Error Information Register 4 */
#define MTU_MC18_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00622FAu)

/** \brief 1300, Configuration Registers */
#define MTU_MC19_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062300u)

/** \brief 1302, Configuration Register 1 */
#define MTU_MC19_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062302u)

/** \brief 1304, MBIST Control Register */
#define MTU_MC19_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062304u)

/** \brief 1306, Status Register */
#define MTU_MC19_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062306u)

/** \brief 1308, Range Register, single address mode */
#define MTU_MC19_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062308u)

/** \brief 130C, Revision ID Register */
#define MTU_MC19_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006230Cu)

/** \brief 130E, ECC Safety Register */
#define MTU_MC19_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006230Eu)

/** \brief 1310, Memory ECC Detection Register */
#define MTU_MC19_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062310u)

/** \brief 1312, Error Tracking Register 0 */
#define MTU_MC19_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062312u)

/** \brief 1314, Error Tracking Register 1 */
#define MTU_MC19_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062314u)

/** \brief 1316, Error Tracking Register 2 */
#define MTU_MC19_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062316u)

/** \brief 1318, Error Tracking Register 3 */
#define MTU_MC19_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062318u)

/** \brief 131A, Error Tracking Register 4 */
#define MTU_MC19_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006231Au)

/** \brief 1360, Read Data and Bit Flip Register 0 */
#define MTU_MC19_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062360u)

/** \brief 1362, Read Data and Bit Flip Register 1 */
#define MTU_MC19_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062362u)

/** \brief 1364, Read Data and Bit Flip Register 2 */
#define MTU_MC19_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062364u)

/** \brief 1366, Read Data and Bit Flip Register 3 */
#define MTU_MC19_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062366u)

/** \brief 1368, Read Data and Bit Flip Register 4 */
#define MTU_MC19_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062368u)

/** \brief 136A, Read Data and Bit Flip Register 5 */
#define MTU_MC19_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006236Au)

/** \brief 136C, Read Data and Bit Flip Register 6 */
#define MTU_MC19_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006236Cu)

/** \brief 136E, Read Data and Bit Flip Register 7 */
#define MTU_MC19_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006236Eu)

/** \brief 1370, Read Data and Bit Flip Register 8 */
#define MTU_MC19_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062370u)

/** \brief 1372, Read Data and Bit Flip Register 9 */
#define MTU_MC19_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062372u)

/** \brief 1374, Read Data and Bit Flip Register 10 */
#define MTU_MC19_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062374u)

/** \brief 1376, Read Data and Bit Flip Register 11 */
#define MTU_MC19_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062376u)

/** \brief 1378, Read Data and Bit Flip Register 12 */
#define MTU_MC19_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062378u)

/** \brief 137A, Read Data and Bit Flip Register 13 */
#define MTU_MC19_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006237Au)

/** \brief 137C, Read Data and Bit Flip Register 14 */
#define MTU_MC19_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006237Cu)

/** \brief 137E, Read Data and Bit Flip Register 15 */
#define MTU_MC19_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006237Eu)

/** \brief 1380, Read Data and Bit Flip Register 16 */
#define MTU_MC19_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062380u)

/** \brief 1382, Read Data and Bit Flip Register 17 */
#define MTU_MC19_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062382u)

/** \brief 1384, Read Data and Bit Flip Register 18 */
#define MTU_MC19_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062384u)

/** \brief 1386, Read Data and Bit Flip Register 19 */
#define MTU_MC19_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062386u)

/** \brief 1388, Read Data and Bit Flip Register 20 */
#define MTU_MC19_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062388u)

/** \brief 138A, Read Data and Bit Flip Register 21 */
#define MTU_MC19_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006238Au)

/** \brief 138C, Read Data and Bit Flip Register 22 */
#define MTU_MC19_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006238Cu)

/** \brief 138E, Read Data and Bit Flip Register 23 */
#define MTU_MC19_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006238Eu)

/** \brief 1390, Read Data and Bit Flip Register 24 */
#define MTU_MC19_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062390u)

/** \brief 1392, Read Data and Bit Flip Register 25 */
#define MTU_MC19_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062392u)

/** \brief 1394, Read Data and Bit Flip Register 26 */
#define MTU_MC19_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062394u)

