dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 13F0, SSH Safety Faults Status Register  */
#define MTU_MC19_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00623F0u)

/** \brief 13F2, Error Information Register 0 */
#define MTU_MC19_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623F2u)

/** \brief 13F4, Error Information Register 1 */
#define MTU_MC19_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623F4u)

/** \brief 13F6, Error Information Register 2 */
#define MTU_MC19_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623F6u)

/** \brief 13F8, Error Information Register 3 */
#define MTU_MC19_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623F8u)

/** \brief 13FA, Error Information Register 4 */
#define MTU_MC19_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00623FAu)

/** \brief 1400, Configuration Registers */
#define MTU_MC20_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062400u)

/** \brief 1402, Configuration Register 1 */
#define MTU_MC20_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062402u)

/** \brief 1404, MBIST Control Register */
#define MTU_MC20_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062404u)

/** \brief 1406, Status Register */
#define MTU_MC20_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062406u)

/** \brief 1408, Range Register, single address mode */
#define MTU_MC20_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062408u)

/** \brief 140C, Revision ID Register */
#define MTU_MC20_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006240Cu)

/** \brief 140E, ECC Safety Register */
#define MTU_MC20_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006240Eu)

/** \brief 1410, Memory ECC Detection Register */
#define MTU_MC20_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062410u)

/** \brief 1412, Error Tracking Register 0 */
#define MTU_MC20_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062412u)

/** \brief 1414, Error Tracking Register 1 */
#define MTU_MC20_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062414u)

/** \brief 1416, Error Tracking Register 2 */
#define MTU_MC20_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062416u)

/** \brief 1418, Error Tracking Register 3 */
#define MTU_MC20_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062418u)

/** \brief 141A, Error Tracking Register 4 */
#define MTU_MC20_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006241Au)

/** \brief 1460, Read Data and Bit Flip Register 0 */
#define MTU_MC20_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062460u)

/** \brief 1462, Read Data and Bit Flip Register 1 */
#define MTU_MC20_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062462u)

/** \brief 1464, Read Data and Bit Flip Register 2 */
#define MTU_MC20_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062464u)

/** \brief 1466, Read Data and Bit Flip Register 3 */
#define MTU_MC20_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062466u)

/** \brief 1468, Read Data and Bit Flip Register 4 */
#define MTU_MC20_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062468u)

/** \brief 146A, Read Data and Bit Flip Register 5 */
#define MTU_MC20_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006246Au)

/** \brief 146C, Read Data and Bit Flip Register 6 */
#define MTU_MC20_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006246Cu)

/** \brief 146E, Read Data and Bit Flip Register 7 */
#define MTU_MC20_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006246Eu)

/** \brief 1470, Read Data and Bit Flip Register 8 */
#define MTU_MC20_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062470u)

/** \brief 1472, Read Data and Bit Flip Register 9 */
#define MTU_MC20_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062472u)

/** \brief 1474, Read Data and Bit Flip Register 10 */
#define MTU_MC20_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062474u)

/** \brief 1476, Read Data and Bit Flip Register 11 */
#define MTU_MC20_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062476u)

/** \brief 1478, Read Data and Bit Flip Register 12 */
#define MTU_MC20_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062478u)

/** \brief 147A, Read Data and Bit Flip Register 13 */
#define MTU_MC20_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006247Au)

/** \brief 147C, Read Data and Bit Flip Register 14 */
#define MTU_MC20_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006247Cu)

/** \brief 147E, Read Data and Bit Flip Register 15 */
#define MTU_MC20_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006247Eu)

/** \brief 1480, Read Data and Bit Flip Register 16 */
#define MTU_MC20_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062480u)

/** \brief 1482, Read Data and Bit Flip Register 17 */
#define MTU_MC20_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062482u)

/** \brief 1484, Read Data and Bit Flip Register 18 */
#define MTU_MC20_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062484u)

/** \brief 1486, Read Data and Bit Flip Register 19 */
#define MTU_MC20_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062486u)

/** \brief 1488, Read Data and Bit Flip Register 20 */
#define MTU_MC20_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062488u)

/** \brief 148A, Read Data and Bit Flip Register 21 */
#define MTU_MC20_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006248Au)

/** \brief 148C, Read Data and Bit Flip Register 22 */
#define MTU_MC20_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006248Cu)

/** \brief 148E, Read Data and Bit Flip Register 23 */
#define MTU_MC20_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006248Eu)

/** \brief 1490, Read Data and Bit Flip Register 24 */
#define MTU_MC20_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062490u)

