dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 1B64, Read Data and Bit Flip Register 2 */
#define MTU_MC27_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B64u)

/** \brief 1B66, Read Data and Bit Flip Register 3 */
#define MTU_MC27_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B66u)

/** \brief 1B68, Read Data and Bit Flip Register 4 */
#define MTU_MC27_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B68u)

/** \brief 1B6A, Read Data and Bit Flip Register 5 */
#define MTU_MC27_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B6Au)

/** \brief 1B6C, Read Data and Bit Flip Register 6 */
#define MTU_MC27_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B6Cu)

/** \brief 1B6E, Read Data and Bit Flip Register 7 */
#define MTU_MC27_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B6Eu)

/** \brief 1B70, Read Data and Bit Flip Register 8 */
#define MTU_MC27_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B70u)

/** \brief 1B72, Read Data and Bit Flip Register 9 */
#define MTU_MC27_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B72u)

/** \brief 1B74, Read Data and Bit Flip Register 10 */
#define MTU_MC27_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B74u)

/** \brief 1B76, Read Data and Bit Flip Register 11 */
#define MTU_MC27_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B76u)

/** \brief 1B78, Read Data and Bit Flip Register 12 */
#define MTU_MC27_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B78u)

/** \brief 1B7A, Read Data and Bit Flip Register 13 */
#define MTU_MC27_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B7Au)

/** \brief 1B7C, Read Data and Bit Flip Register 14 */
#define MTU_MC27_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B7Cu)

/** \brief 1B7E, Read Data and Bit Flip Register 15 */
#define MTU_MC27_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B7Eu)

/** \brief 1B80, Read Data and Bit Flip Register 16 */
#define MTU_MC27_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B80u)

/** \brief 1B82, Read Data and Bit Flip Register 17 */
#define MTU_MC27_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B82u)

/** \brief 1B84, Read Data and Bit Flip Register 18 */
#define MTU_MC27_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B84u)

/** \brief 1B86, Read Data and Bit Flip Register 19 */
#define MTU_MC27_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B86u)

/** \brief 1B88, Read Data and Bit Flip Register 20 */
#define MTU_MC27_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B88u)

/** \brief 1B8A, Read Data and Bit Flip Register 21 */
#define MTU_MC27_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B8Au)

/** \brief 1B8C, Read Data and Bit Flip Register 22 */
#define MTU_MC27_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B8Cu)

/** \brief 1B8E, Read Data and Bit Flip Register 23 */
#define MTU_MC27_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B8Eu)

/** \brief 1B90, Read Data and Bit Flip Register 24 */
#define MTU_MC27_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B90u)

/** \brief 1B92, Read Data and Bit Flip Register 25 */
#define MTU_MC27_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B92u)

/** \brief 1B94, Read Data and Bit Flip Register 26 */
#define MTU_MC27_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B94u)

/** \brief 1B96, Read Data and Bit Flip Register 27 */
#define MTU_MC27_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B96u)

/** \brief 1B98, Read Data and Bit Flip Register 28 */
#define MTU_MC27_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B98u)

/** \brief 1B9A, Read Data and Bit Flip Register 29 */
#define MTU_MC27_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B9Au)

/** \brief 1B9C, Read Data and Bit Flip Register 30 */
#define MTU_MC27_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B9Cu)

/** \brief 1B9E, Read Data and Bit Flip Register 31 */
#define MTU_MC27_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B9Eu)

/** \brief 1BA0, Read Data and Bit Flip Register 32 */
#define MTU_MC27_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BA0u)

/** \brief 1BA2, Read Data and Bit Flip Register 33 */
#define MTU_MC27_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BA2u)

/** \brief 1BA4, Read Data and Bit Flip Register 34 */
#define MTU_MC27_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BA4u)

/** \brief 1BA6, Read Data and Bit Flip Register 35 */
#define MTU_MC27_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BA6u)

/** \brief 1BA8, Read Data and Bit Flip Register 36 */
#define MTU_MC27_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BA8u)

/** \brief 1BAA, Read Data and Bit Flip Register 37 */
#define MTU_MC27_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BAAu)

/** \brief 1BAC, Read Data and Bit Flip Register 38 */
#define MTU_MC27_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BACu)

/** \brief 1BAE, Read Data and Bit Flip Register 39 */
#define MTU_MC27_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BAEu)

/** \brief 1BB0, Read Data and Bit Flip Register 40 */
#define MTU_MC27_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BB0u)

/** \brief 1BB2, Read Data and Bit Flip Register 41 */
#define MTU_MC27_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BB2u)

/** \brief 1BB4, Read Data and Bit Flip Register 42 */
#define MTU_MC27_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062BB4u)

