dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 1E64, Read Data and Bit Flip Register 2 */
#define MTU_MC30_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E64u)

/** \brief 1E66, Read Data and Bit Flip Register 3 */
#define MTU_MC30_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E66u)

/** \brief 1E68, Read Data and Bit Flip Register 4 */
#define MTU_MC30_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E68u)

/** \brief 1E6A, Read Data and Bit Flip Register 5 */
#define MTU_MC30_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E6Au)

/** \brief 1E6C, Read Data and Bit Flip Register 6 */
#define MTU_MC30_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E6Cu)

/** \brief 1E6E, Read Data and Bit Flip Register 7 */
#define MTU_MC30_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E6Eu)

/** \brief 1E70, Read Data and Bit Flip Register 8 */
#define MTU_MC30_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E70u)

/** \brief 1E72, Read Data and Bit Flip Register 9 */
#define MTU_MC30_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E72u)

/** \brief 1E74, Read Data and Bit Flip Register 10 */
#define MTU_MC30_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E74u)

/** \brief 1E76, Read Data and Bit Flip Register 11 */
#define MTU_MC30_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E76u)

/** \brief 1E78, Read Data and Bit Flip Register 12 */
#define MTU_MC30_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E78u)

/** \brief 1E7A, Read Data and Bit Flip Register 13 */
#define MTU_MC30_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E7Au)

/** \brief 1E7C, Read Data and Bit Flip Register 14 */
#define MTU_MC30_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E7Cu)

/** \brief 1E7E, Read Data and Bit Flip Register 15 */
#define MTU_MC30_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E7Eu)

/** \brief 1E80, Read Data and Bit Flip Register 16 */
#define MTU_MC30_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E80u)

/** \brief 1E82, Read Data and Bit Flip Register 17 */
#define MTU_MC30_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E82u)

/** \brief 1E84, Read Data and Bit Flip Register 18 */
#define MTU_MC30_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E84u)

/** \brief 1E86, Read Data and Bit Flip Register 19 */
#define MTU_MC30_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E86u)

/** \brief 1E88, Read Data and Bit Flip Register 20 */
#define MTU_MC30_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E88u)

/** \brief 1E8A, Read Data and Bit Flip Register 21 */
#define MTU_MC30_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E8Au)

/** \brief 1E8C, Read Data and Bit Flip Register 22 */
#define MTU_MC30_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E8Cu)

/** \brief 1E8E, Read Data and Bit Flip Register 23 */
#define MTU_MC30_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E8Eu)

/** \brief 1E90, Read Data and Bit Flip Register 24 */
#define MTU_MC30_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E90u)

/** \brief 1E92, Read Data and Bit Flip Register 25 */
#define MTU_MC30_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E92u)

/** \brief 1E94, Read Data and Bit Flip Register 26 */
#define MTU_MC30_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E94u)

/** \brief 1E96, Read Data and Bit Flip Register 27 */
#define MTU_MC30_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E96u)

/** \brief 1E98, Read Data and Bit Flip Register 28 */
#define MTU_MC30_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E98u)

/** \brief 1E9A, Read Data and Bit Flip Register 29 */
#define MTU_MC30_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E9Au)

/** \brief 1E9C, Read Data and Bit Flip Register 30 */
#define MTU_MC30_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E9Cu)

/** \brief 1E9E, Read Data and Bit Flip Register 31 */
#define MTU_MC30_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E9Eu)

/** \brief 1EA0, Read Data and Bit Flip Register 32 */
#define MTU_MC30_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA0u)

/** \brief 1EA2, Read Data and Bit Flip Register 33 */
#define MTU_MC30_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA2u)

/** \brief 1EA4, Read Data and Bit Flip Register 34 */
#define MTU_MC30_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA4u)

/** \brief 1EA6, Read Data and Bit Flip Register 35 */
#define MTU_MC30_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA6u)

/** \brief 1EA8, Read Data and Bit Flip Register 36 */
#define MTU_MC30_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EA8u)

/** \brief 1EAA, Read Data and Bit Flip Register 37 */
#define MTU_MC30_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EAAu)

/** \brief 1EAC, Read Data and Bit Flip Register 38 */
#define MTU_MC30_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EACu)

/** \brief 1EAE, Read Data and Bit Flip Register 39 */
#define MTU_MC30_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EAEu)

/** \brief 1EB0, Read Data and Bit Flip Register 40 */
#define MTU_MC30_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB0u)

/** \brief 1EB2, Read Data and Bit Flip Register 41 */
#define MTU_MC30_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB2u)

/** \brief 1EB4, Read Data and Bit Flip Register 42 */
#define MTU_MC30_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB4u)

