dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 24CC, Read Data and Bit Flip Register 54 */
#define MTU_MC36_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634CCu)

/** \brief 24CE, Read Data and Bit Flip Register 55 */
#define MTU_MC36_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634CEu)

/** \brief 24D0, Read Data and Bit Flip Register 56 */
#define MTU_MC36_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D0u)

/** \brief 24D2, Read Data and Bit Flip Register 57 */
#define MTU_MC36_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D2u)

/** \brief 24D4, Read Data and Bit Flip Register 58 */
#define MTU_MC36_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D4u)

/** \brief 24D6, Read Data and Bit Flip Register 59 */
#define MTU_MC36_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D6u)

/** \brief 24D8, Read Data and Bit Flip Register 60 */
#define MTU_MC36_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634D8u)

/** \brief 24DA, Read Data and Bit Flip Register 61 */
#define MTU_MC36_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634DAu)

/** \brief 24DC, Read Data and Bit Flip Register 62 */
#define MTU_MC36_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634DCu)

/** \brief 24DE, Read Data and Bit Flip Register 63 */
#define MTU_MC36_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634DEu)

/** \brief 24E0, Read Data and Bit Flip Register 64 */
#define MTU_MC36_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634E0u)

/** \brief 24E2, Read Data and Bit Flip Register 65 */
#define MTU_MC36_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634E2u)

/** \brief 24E4, Read Data and Bit Flip Register 66 */
#define MTU_MC36_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00634E4u)

/** \brief 24EE, Alarm Sources Configuration Register */
#define MTU_MC36_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00634EEu)

/** \brief 24F0, SSH Safety Faults Status Register  */
#define MTU_MC36_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00634F0u)

/** \brief 24F2, Error Information Register 0 */
#define MTU_MC36_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634F2u)

/** \brief 24F4, Error Information Register 1 */
#define MTU_MC36_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634F4u)

/** \brief 24F6, Error Information Register 2 */
#define MTU_MC36_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634F6u)

/** \brief 24F8, Error Information Register 3 */
#define MTU_MC36_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634F8u)

/** \brief 24FA, Error Information Register 4 */
#define MTU_MC36_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00634FAu)

/** \brief 2500, Configuration Registers */
#define MTU_MC37_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063500u)

/** \brief 2502, Configuration Register 1 */
#define MTU_MC37_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063502u)

/** \brief 2504, MBIST Control Register */
#define MTU_MC37_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063504u)

/** \brief 2506, Status Register */
#define MTU_MC37_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063506u)

/** \brief 2508, Range Register, single address mode */
#define MTU_MC37_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063508u)

/** \brief 250C, Revision ID Register */
#define MTU_MC37_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006350Cu)

/** \brief 250E, ECC Safety Register */
#define MTU_MC37_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006350Eu)

/** \brief 2510, Memory ECC Detection Register */
#define MTU_MC37_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063510u)

/** \brief 2512, Error Tracking Register 0 */
#define MTU_MC37_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063512u)

/** \brief 2514, Error Tracking Register 1 */
#define MTU_MC37_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063514u)

/** \brief 2516, Error Tracking Register 2 */
#define MTU_MC37_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063516u)

/** \brief 2518, Error Tracking Register 3 */
#define MTU_MC37_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063518u)

/** \brief 251A, Error Tracking Register 4 */
#define MTU_MC37_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006351Au)

/** \brief 2560, Read Data and Bit Flip Register 0 */
#define MTU_MC37_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063560u)

/** \brief 2562, Read Data and Bit Flip Register 1 */
#define MTU_MC37_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063562u)

/** \brief 2564, Read Data and Bit Flip Register 2 */
#define MTU_MC37_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063564u)

/** \brief 2566, Read Data and Bit Flip Register 3 */
#define MTU_MC37_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063566u)

/** \brief 2568, Read Data and Bit Flip Register 4 */
#define MTU_MC37_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063568u)

/** \brief 256A, Read Data and Bit Flip Register 5 */
#define MTU_MC37_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006356Au)

/** \brief 256C, Read Data and Bit Flip Register 6 */
#define MTU_MC37_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006356Cu)

/** \brief 256E, Read Data and Bit Flip Register 7 */
#define MTU_MC37_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006356Eu)

/** \brief 2570, Read Data and Bit Flip Register 8 */
#define MTU_MC37_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063570u)

/** \brief 2572, Read Data and Bit Flip Register 9 */
#define MTU_MC37_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063572u)

