dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 2678, Read Data and Bit Flip Register 12 */
#define MTU_MC38_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063678u)

/** \brief 267A, Read Data and Bit Flip Register 13 */
#define MTU_MC38_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006367Au)

/** \brief 267C, Read Data and Bit Flip Register 14 */
#define MTU_MC38_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006367Cu)

/** \brief 267E, Read Data and Bit Flip Register 15 */
#define MTU_MC38_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006367Eu)

/** \brief 2680, Read Data and Bit Flip Register 16 */
#define MTU_MC38_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063680u)

/** \brief 2682, Read Data and Bit Flip Register 17 */
#define MTU_MC38_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063682u)

/** \brief 2684, Read Data and Bit Flip Register 18 */
#define MTU_MC38_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063684u)

/** \brief 2686, Read Data and Bit Flip Register 19 */
#define MTU_MC38_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063686u)

/** \brief 2688, Read Data and Bit Flip Register 20 */
#define MTU_MC38_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063688u)

/** \brief 268A, Read Data and Bit Flip Register 21 */
#define MTU_MC38_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006368Au)

/** \brief 268C, Read Data and Bit Flip Register 22 */
#define MTU_MC38_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006368Cu)

/** \brief 268E, Read Data and Bit Flip Register 23 */
#define MTU_MC38_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006368Eu)

/** \brief 2690, Read Data and Bit Flip Register 24 */
#define MTU_MC38_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063690u)

/** \brief 2692, Read Data and Bit Flip Register 25 */
#define MTU_MC38_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063692u)

/** \brief 2694, Read Data and Bit Flip Register 26 */
#define MTU_MC38_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063694u)

/** \brief 2696, Read Data and Bit Flip Register 27 */
#define MTU_MC38_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063696u)

/** \brief 2698, Read Data and Bit Flip Register 28 */
#define MTU_MC38_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063698u)

/** \brief 269A, Read Data and Bit Flip Register 29 */
#define MTU_MC38_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006369Au)

/** \brief 269C, Read Data and Bit Flip Register 30 */
#define MTU_MC38_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006369Cu)

/** \brief 269E, Read Data and Bit Flip Register 31 */
#define MTU_MC38_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006369Eu)

/** \brief 26A0, Read Data and Bit Flip Register 32 */
#define MTU_MC38_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A0u)

/** \brief 26A2, Read Data and Bit Flip Register 33 */
#define MTU_MC38_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A2u)

/** \brief 26A4, Read Data and Bit Flip Register 34 */
#define MTU_MC38_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A4u)

/** \brief 26A6, Read Data and Bit Flip Register 35 */
#define MTU_MC38_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A6u)

/** \brief 26A8, Read Data and Bit Flip Register 36 */
#define MTU_MC38_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636A8u)

/** \brief 26AA, Read Data and Bit Flip Register 37 */
#define MTU_MC38_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636AAu)

/** \brief 26AC, Read Data and Bit Flip Register 38 */
#define MTU_MC38_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636ACu)

/** \brief 26AE, Read Data and Bit Flip Register 39 */
#define MTU_MC38_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636AEu)

/** \brief 26B0, Read Data and Bit Flip Register 40 */
#define MTU_MC38_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B0u)

/** \brief 26B2, Read Data and Bit Flip Register 41 */
#define MTU_MC38_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B2u)

/** \brief 26B4, Read Data and Bit Flip Register 42 */
#define MTU_MC38_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B4u)

/** \brief 26B6, Read Data and Bit Flip Register 43 */
#define MTU_MC38_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B6u)

/** \brief 26B8, Read Data and Bit Flip Register 44 */
#define MTU_MC38_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636B8u)

/** \brief 26BA, Read Data and Bit Flip Register 45 */
#define MTU_MC38_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636BAu)

/** \brief 26BC, Read Data and Bit Flip Register 46 */
#define MTU_MC38_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636BCu)

/** \brief 26BE, Read Data and Bit Flip Register 47 */
#define MTU_MC38_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636BEu)

/** \brief 26C0, Read Data and Bit Flip Register 48 */
#define MTU_MC38_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C0u)

/** \brief 26C2, Read Data and Bit Flip Register 49 */
#define MTU_MC38_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C2u)

/** \brief 26C4, Read Data and Bit Flip Register 50 */
#define MTU_MC38_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C4u)

/** \brief 26C6, Read Data and Bit Flip Register 51 */
#define MTU_MC38_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C6u)

/** \brief 26C8, Read Data and Bit Flip Register 52 */
#define MTU_MC38_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636C8u)

/** \brief 26CA, Read Data and Bit Flip Register 53 */
#define MTU_MC38_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636CAu)

/** \brief 26CC, Read Data and Bit Flip Register 54 */
#define MTU_MC38_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00636CCu)

