dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 29A0, Read Data and Bit Flip Register 32 */
#define MTU_MC41_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A0u)

/** \brief 29A2, Read Data and Bit Flip Register 33 */
#define MTU_MC41_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A2u)

/** \brief 29A4, Read Data and Bit Flip Register 34 */
#define MTU_MC41_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A4u)

/** \brief 29A6, Read Data and Bit Flip Register 35 */
#define MTU_MC41_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A6u)

/** \brief 29A8, Read Data and Bit Flip Register 36 */
#define MTU_MC41_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639A8u)

/** \brief 29AA, Read Data and Bit Flip Register 37 */
#define MTU_MC41_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639AAu)

/** \brief 29AC, Read Data and Bit Flip Register 38 */
#define MTU_MC41_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639ACu)

/** \brief 29AE, Read Data and Bit Flip Register 39 */
#define MTU_MC41_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639AEu)

/** \brief 29B0, Read Data and Bit Flip Register 40 */
#define MTU_MC41_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B0u)

/** \brief 29B2, Read Data and Bit Flip Register 41 */
#define MTU_MC41_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B2u)

/** \brief 29B4, Read Data and Bit Flip Register 42 */
#define MTU_MC41_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B4u)

/** \brief 29B6, Read Data and Bit Flip Register 43 */
#define MTU_MC41_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B6u)

/** \brief 29B8, Read Data and Bit Flip Register 44 */
#define MTU_MC41_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639B8u)

/** \brief 29BA, Read Data and Bit Flip Register 45 */
#define MTU_MC41_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639BAu)

/** \brief 29BC, Read Data and Bit Flip Register 46 */
#define MTU_MC41_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639BCu)

/** \brief 29BE, Read Data and Bit Flip Register 47 */
#define MTU_MC41_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639BEu)

/** \brief 29C0, Read Data and Bit Flip Register 48 */
#define MTU_MC41_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C0u)

/** \brief 29C2, Read Data and Bit Flip Register 49 */
#define MTU_MC41_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C2u)

/** \brief 29C4, Read Data and Bit Flip Register 50 */
#define MTU_MC41_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C4u)

/** \brief 29C6, Read Data and Bit Flip Register 51 */
#define MTU_MC41_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C6u)

/** \brief 29C8, Read Data and Bit Flip Register 52 */
#define MTU_MC41_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639C8u)

/** \brief 29CA, Read Data and Bit Flip Register 53 */
#define MTU_MC41_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639CAu)

/** \brief 29CC, Read Data and Bit Flip Register 54 */
#define MTU_MC41_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639CCu)

/** \brief 29CE, Read Data and Bit Flip Register 55 */
#define MTU_MC41_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639CEu)

/** \brief 29D0, Read Data and Bit Flip Register 56 */
#define MTU_MC41_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D0u)

/** \brief 29D2, Read Data and Bit Flip Register 57 */
#define MTU_MC41_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D2u)

/** \brief 29D4, Read Data and Bit Flip Register 58 */
#define MTU_MC41_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D4u)

/** \brief 29D6, Read Data and Bit Flip Register 59 */
#define MTU_MC41_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D6u)

/** \brief 29D8, Read Data and Bit Flip Register 60 */
#define MTU_MC41_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639D8u)

/** \brief 29DA, Read Data and Bit Flip Register 61 */
#define MTU_MC41_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639DAu)

/** \brief 29DC, Read Data and Bit Flip Register 62 */
#define MTU_MC41_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639DCu)

/** \brief 29DE, Read Data and Bit Flip Register 63 */
#define MTU_MC41_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639DEu)

/** \brief 29E0, Read Data and Bit Flip Register 64 */
#define MTU_MC41_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639E0u)

/** \brief 29E2, Read Data and Bit Flip Register 65 */
#define MTU_MC41_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639E2u)

/** \brief 29E4, Read Data and Bit Flip Register 66 */
#define MTU_MC41_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00639E4u)

/** \brief 29EE, Alarm Sources Configuration Register */
#define MTU_MC41_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00639EEu)

/** \brief 29F0, SSH Safety Faults Status Register  */
#define MTU_MC41_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00639F0u)

/** \brief 29F2, Error Information Register 0 */
#define MTU_MC41_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639F2u)

/** \brief 29F4, Error Information Register 1 */
#define MTU_MC41_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639F4u)

/** \brief 29F6, Error Information Register 2 */
#define MTU_MC41_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639F6u)

/** \brief 29F8, Error Information Register 3 */
#define MTU_MC41_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639F8u)

/** \brief 29FA, Error Information Register 4 */
#define MTU_MC41_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00639FAu)

/** \brief 2A00, Configuration Registers */
#define MTU_MC42_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063A00u)

