dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 33F4, Error Information Register 1 */
#define MTU_MC51_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643F4u)

/** \brief 33F6, Error Information Register 2 */
#define MTU_MC51_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643F6u)

/** \brief 33F8, Error Information Register 3 */
#define MTU_MC51_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643F8u)

/** \brief 33FA, Error Information Register 4 */
#define MTU_MC51_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643FAu)

/** \brief 3400, Configuration Registers */
#define MTU_MC52_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064400u)

/** \brief 3402, Configuration Register 1 */
#define MTU_MC52_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064402u)

/** \brief 3404, MBIST Control Register */
#define MTU_MC52_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064404u)

/** \brief 3406, Status Register */
#define MTU_MC52_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064406u)

/** \brief 3408, Range Register, single address mode */
#define MTU_MC52_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064408u)

/** \brief 340C, Revision ID Register */
#define MTU_MC52_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006440Cu)

/** \brief 340E, ECC Safety Register */
#define MTU_MC52_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006440Eu)

/** \brief 3410, Memory ECC Detection Register */
#define MTU_MC52_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064410u)

/** \brief 3412, Error Tracking Register 0 */
#define MTU_MC52_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064412u)

/** \brief 3414, Error Tracking Register 1 */
#define MTU_MC52_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064414u)

/** \brief 3416, Error Tracking Register 2 */
#define MTU_MC52_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064416u)

/** \brief 3418, Error Tracking Register 3 */
#define MTU_MC52_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064418u)

/** \brief 341A, Error Tracking Register 4 */
#define MTU_MC52_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006441Au)

/** \brief 3460, Read Data and Bit Flip Register 0 */
#define MTU_MC52_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064460u)

/** \brief 3462, Read Data and Bit Flip Register 1 */
#define MTU_MC52_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064462u)

/** \brief 3464, Read Data and Bit Flip Register 2 */
#define MTU_MC52_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064464u)

/** \brief 3466, Read Data and Bit Flip Register 3 */
#define MTU_MC52_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064466u)

/** \brief 3468, Read Data and Bit Flip Register 4 */
#define MTU_MC52_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064468u)

/** \brief 346A, Read Data and Bit Flip Register 5 */
#define MTU_MC52_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006446Au)

/** \brief 346C, Read Data and Bit Flip Register 6 */
#define MTU_MC52_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006446Cu)

/** \brief 346E, Read Data and Bit Flip Register 7 */
#define MTU_MC52_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006446Eu)

/** \brief 3470, Read Data and Bit Flip Register 8 */
#define MTU_MC52_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064470u)

/** \brief 3472, Read Data and Bit Flip Register 9 */
#define MTU_MC52_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064472u)

/** \brief 3474, Read Data and Bit Flip Register 10 */
#define MTU_MC52_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064474u)

/** \brief 3476, Read Data and Bit Flip Register 11 */
#define MTU_MC52_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064476u)

/** \brief 3478, Read Data and Bit Flip Register 12 */
#define MTU_MC52_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064478u)

/** \brief 347A, Read Data and Bit Flip Register 13 */
#define MTU_MC52_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006447Au)

/** \brief 347C, Read Data and Bit Flip Register 14 */
#define MTU_MC52_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006447Cu)

/** \brief 347E, Read Data and Bit Flip Register 15 */
#define MTU_MC52_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006447Eu)

/** \brief 3480, Read Data and Bit Flip Register 16 */
#define MTU_MC52_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064480u)

/** \brief 3482, Read Data and Bit Flip Register 17 */
#define MTU_MC52_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064482u)

/** \brief 3484, Read Data and Bit Flip Register 18 */
#define MTU_MC52_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064484u)

/** \brief 3486, Read Data and Bit Flip Register 19 */
#define MTU_MC52_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064486u)

/** \brief 3488, Read Data and Bit Flip Register 20 */
#define MTU_MC52_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064488u)

/** \brief 348A, Read Data and Bit Flip Register 21 */
#define MTU_MC52_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006448Au)

/** \brief 348C, Read Data and Bit Flip Register 22 */
#define MTU_MC52_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006448Cu)

/** \brief 348E, Read Data and Bit Flip Register 23 */
#define MTU_MC52_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006448Eu)

/** \brief 3490, Read Data and Bit Flip Register 24 */
#define MTU_MC52_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064490u)

/** \brief 3492, Read Data and Bit Flip Register 25 */
#define MTU_MC52_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064492u)

