dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 47CC, Read Data and Bit Flip Register 54 */
#define MTU_MC71_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657CCu)

/** \brief 47CE, Read Data and Bit Flip Register 55 */
#define MTU_MC71_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657CEu)

/** \brief 47D0, Read Data and Bit Flip Register 56 */
#define MTU_MC71_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657D0u)

/** \brief 47D2, Read Data and Bit Flip Register 57 */
#define MTU_MC71_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657D2u)

/** \brief 47D4, Read Data and Bit Flip Register 58 */
#define MTU_MC71_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657D4u)

/** \brief 47D6, Read Data and Bit Flip Register 59 */
#define MTU_MC71_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657D6u)

/** \brief 47D8, Read Data and Bit Flip Register 60 */
#define MTU_MC71_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657D8u)

/** \brief 47DA, Read Data and Bit Flip Register 61 */
#define MTU_MC71_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657DAu)

/** \brief 47DC, Read Data and Bit Flip Register 62 */
#define MTU_MC71_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657DCu)

/** \brief 47DE, Read Data and Bit Flip Register 63 */
#define MTU_MC71_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657DEu)

/** \brief 47E0, Read Data and Bit Flip Register 64 */
#define MTU_MC71_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657E0u)

/** \brief 47E2, Read Data and Bit Flip Register 65 */
#define MTU_MC71_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657E2u)

/** \brief 47E4, Read Data and Bit Flip Register 66 */
#define MTU_MC71_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657E4u)

/** \brief 47EE, Alarm Sources Configuration Register */
#define MTU_MC71_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00657EEu)

/** \brief 47F0, SSH Safety Faults Status Register  */
#define MTU_MC71_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00657F0u)

/** \brief 47F2, Error Information Register 0 */
#define MTU_MC71_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00657F2u)

/** \brief 47F4, Error Information Register 1 */
#define MTU_MC71_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00657F4u)

/** \brief 47F6, Error Information Register 2 */
#define MTU_MC71_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00657F6u)

/** \brief 47F8, Error Information Register 3 */
#define MTU_MC71_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00657F8u)

/** \brief 47FA, Error Information Register 4 */
#define MTU_MC71_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00657FAu)

/** \brief 4800, Configuration Registers */
#define MTU_MC72_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065800u)

/** \brief 4802, Configuration Register 1 */
#define MTU_MC72_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065802u)

/** \brief 4804, MBIST Control Register */
#define MTU_MC72_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065804u)

/** \brief 4806, Status Register */
#define MTU_MC72_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065806u)

/** \brief 4808, Range Register, single address mode */
#define MTU_MC72_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065808u)

/** \brief 480C, Revision ID Register */
#define MTU_MC72_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006580Cu)

/** \brief 480E, ECC Safety Register */
#define MTU_MC72_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006580Eu)

/** \brief 4810, Memory ECC Detection Register */
#define MTU_MC72_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065810u)

/** \brief 4812, Error Tracking Register 0 */
#define MTU_MC72_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065812u)

/** \brief 4814, Error Tracking Register 1 */
#define MTU_MC72_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065814u)

/** \brief 4816, Error Tracking Register 2 */
#define MTU_MC72_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065816u)

/** \brief 4818, Error Tracking Register 3 */
#define MTU_MC72_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065818u)

/** \brief 481A, Error Tracking Register 4 */
#define MTU_MC72_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006581Au)

/** \brief 4860, Read Data and Bit Flip Register 0 */
#define MTU_MC72_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065860u)

/** \brief 4862, Read Data and Bit Flip Register 1 */
#define MTU_MC72_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065862u)

/** \brief 4864, Read Data and Bit Flip Register 2 */
#define MTU_MC72_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065864u)

/** \brief 4866, Read Data and Bit Flip Register 3 */
#define MTU_MC72_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065866u)

/** \brief 4868, Read Data and Bit Flip Register 4 */
#define MTU_MC72_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065868u)

/** \brief 486A, Read Data and Bit Flip Register 5 */
#define MTU_MC72_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006586Au)

/** \brief 486C, Read Data and Bit Flip Register 6 */
#define MTU_MC72_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006586Cu)

/** \brief 486E, Read Data and Bit Flip Register 7 */
#define MTU_MC72_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006586Eu)

/** \brief 4870, Read Data and Bit Flip Register 8 */
#define MTU_MC72_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065870u)

/** \brief 4872, Read Data and Bit Flip Register 9 */
#define MTU_MC72_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065872u)

/** \brief 4874, Read Data and Bit Flip Register 10 */
#define MTU_MC72_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065874u)

/** \brief 4876, Read Data and Bit Flip Register 11 */
#define MTU_MC72_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065876u)

/** \brief 4878, Read Data and Bit Flip Register 12 */
#define MTU_MC72_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065878u)

/** \brief 487A, Read Data and Bit Flip Register 13 */
#define MTU_MC72_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006587Au)

