dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxMtu_reg.h
/** \brief 4FF8, Error Information Register 3 */
#define MTU_MC79_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FF8u)

/** \brief 4FFA, Error Information Register 4 */
#define MTU_MC79_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065FFAu)

/** \brief 5000, Configuration Registers */
#define MTU_MC80_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066000u)

/** \brief 5002, Configuration Register 1 */
#define MTU_MC80_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066002u)

/** \brief 5004, MBIST Control Register */
#define MTU_MC80_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066004u)

/** \brief 5006, Status Register */
#define MTU_MC80_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066006u)

/** \brief 5008, Range Register, single address mode */
#define MTU_MC80_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066008u)

/** \brief 500C, Revision ID Register */
#define MTU_MC80_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006600Cu)

/** \brief 500E, ECC Safety Register */
#define MTU_MC80_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006600Eu)

/** \brief 5010, Memory ECC Detection Register */
#define MTU_MC80_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066010u)

/** \brief 5012, Error Tracking Register 0 */
#define MTU_MC80_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066012u)

/** \brief 5014, Error Tracking Register 1 */
#define MTU_MC80_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066014u)

/** \brief 5016, Error Tracking Register 2 */
#define MTU_MC80_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066016u)

/** \brief 5018, Error Tracking Register 3 */
#define MTU_MC80_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066018u)

/** \brief 501A, Error Tracking Register 4 */
#define MTU_MC80_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006601Au)

/** \brief 5060, Read Data and Bit Flip Register 0 */
#define MTU_MC80_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066060u)

/** \brief 5062, Read Data and Bit Flip Register 1 */
#define MTU_MC80_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066062u)

/** \brief 5064, Read Data and Bit Flip Register 2 */
#define MTU_MC80_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066064u)

/** \brief 5066, Read Data and Bit Flip Register 3 */
#define MTU_MC80_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066066u)

/** \brief 5068, Read Data and Bit Flip Register 4 */
#define MTU_MC80_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066068u)

/** \brief 506A, Read Data and Bit Flip Register 5 */
#define MTU_MC80_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006606Au)

/** \brief 506C, Read Data and Bit Flip Register 6 */
#define MTU_MC80_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006606Cu)

/** \brief 506E, Read Data and Bit Flip Register 7 */
#define MTU_MC80_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006606Eu)

/** \brief 5070, Read Data and Bit Flip Register 8 */
#define MTU_MC80_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066070u)

/** \brief 5072, Read Data and Bit Flip Register 9 */
#define MTU_MC80_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066072u)

/** \brief 5074, Read Data and Bit Flip Register 10 */
#define MTU_MC80_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066074u)

/** \brief 5076, Read Data and Bit Flip Register 11 */
#define MTU_MC80_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066076u)

/** \brief 5078, Read Data and Bit Flip Register 12 */
#define MTU_MC80_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066078u)

/** \brief 507A, Read Data and Bit Flip Register 13 */
#define MTU_MC80_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006607Au)

/** \brief 507C, Read Data and Bit Flip Register 14 */
#define MTU_MC80_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006607Cu)

/** \brief 507E, Read Data and Bit Flip Register 15 */
#define MTU_MC80_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006607Eu)

/** \brief 5080, Read Data and Bit Flip Register 16 */
#define MTU_MC80_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066080u)

/** \brief 5082, Read Data and Bit Flip Register 17 */
#define MTU_MC80_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066082u)

/** \brief 5084, Read Data and Bit Flip Register 18 */
#define MTU_MC80_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066084u)

/** \brief 5086, Read Data and Bit Flip Register 19 */
#define MTU_MC80_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066086u)

/** \brief 5088, Read Data and Bit Flip Register 20 */
#define MTU_MC80_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066088u)

/** \brief 508A, Read Data and Bit Flip Register 21 */
#define MTU_MC80_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006608Au)

/** \brief 508C, Read Data and Bit Flip Register 22 */
#define MTU_MC80_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006608Cu)

/** \brief 508E, Read Data and Bit Flip Register 23 */
#define MTU_MC80_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006608Eu)

/** \brief 5090, Read Data and Bit Flip Register 24 */
#define MTU_MC80_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066090u)

/** \brief 5092, Read Data and Bit Flip Register 25 */
#define MTU_MC80_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066092u)

/** \brief 5094, Read Data and Bit Flip Register 26 */
#define MTU_MC80_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066094u)

/** \brief 5096, Read Data and Bit Flip Register 27 */
#define MTU_MC80_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066096u)

/** \brief 5098, Read Data and Bit Flip Register 28 */
#define MTU_MC80_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066098u)

/** \brief 509A, Read Data and Bit Flip Register 29 */
#define MTU_MC80_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006609Au)

/** \brief 509C, Read Data and Bit Flip Register 30 */
#define MTU_MC80_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006609Cu)

/** \brief 509E, Read Data and Bit Flip Register 31 */
#define MTU_MC80_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006609Eu)

/** \brief 50A0, Read Data and Bit Flip Register 32 */
#define MTU_MC80_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A0u)

/** \brief 50A2, Read Data and Bit Flip Register 33 */
#define MTU_MC80_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A2u)

/** \brief 50A4, Read Data and Bit Flip Register 34 */
#define MTU_MC80_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A4u)

